jvarghes2501/STM32F446_bootloader/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"  // Change to your STM32 series header
#include <stdarg.h>
#include <stdio.h>
#include <string.h>
#include <stdint.h>

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
CRC_HandleTypeDef hcrc;

UART_HandleTypeDef huart2;
UART_HandleTypeDef huart3;
#define Command_UART	&huart2
#define Data_UART 		&huart3


/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_CRC_Init(void);
static void MX_USART3_UART_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
uint8_t BL_rx_buff[BL_RX_SIZE];
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART2_UART_Init();
  MX_CRC_Init();
  MX_USART3_UART_Init();
  /* USER CODE BEGIN 2 */

  /* USER CODE END 2 */

  /* USER CODE BEGIN WHILE */
 if(HAL_GPIO_ReadPin(B1_GPIO_Port, B1_Pin)==GPIO_PIN_RESET){
	 uart_printf("Reset button pressed...Transition to BL mode\n\r");
	 BL_UART_read_data();
 }
 else{
	 uart_printf("Executing user app\n\r");
	 userApp();
 }


 /* Infinite loop */
 /* USER CODE BEGIN WHILE */
 while (1)
 {
   /* USER CODE END WHILE */

   /* USER CODE BEGIN 3 */
 }
  /* USER CODE END 3 */
}

void BL_UART_read_data(void)
{
	uint8_t packet_len = 0;
	while (1)
	{
		memset(BL_rx_buff, 0 , 200); //initialize with 0s

		// read and decode the commands coming from host
		HAL_UART_Receive(Command_UART, BL_rx_buff, 1, HAL_MAX_DELAY); //read one byte from the host, which is the length field of the command packet
		packet_len = BL_rx_buff[0];
		HAL_UART_Receive(Command_UART, &BL_rx_buff[1], packet_len, HAL_MAX_DELAY);

		switch (BL_rx_buff[1])
		{
			case BL_GET_VER:
				BL_getver_handler(BL_rx_buff);
				break;
			case BL_GET_RDP_STATUS:
				BL_getrdp_handler(BL_rx_buff);
			default:
				uart_printf("Invalid command received from host\r\n");
		}

	}
}

void userApp(void){
	uart_printf("Running userApp func\n\r");

	// function pointer to hold the address of the reset handler of the user application
	void (*app_reset_handler)(void);

	// configure the MSP by reading the value from the base address of the sector 2
	uint32_t MSP = *(volatile uint32_t *) FLASH_SECTOR2_BASE_ADDRESS;
	uart_printf("MSP value: %#x\n\r", MSP);

	//set the MSP value
	__set_MSP(MSP);

	//fetch the reset handler address of the user application
	uint32_t resethandler_address  = *(volatile uint32_t * ) (FLASH_SECTOR2_BASE_ADDRESS + 4);

	// jump to reset handler of user application
	app_reset_handler = (void *) resethandler_address;
	uart_printf("Application reset handler addr: %#x\n\r", app_reset_handler);

	app_reset_handler();
}

void uart_printf (const char *fmt, ...) {
    char buffer[128];  // Adjust size as needed
    va_list args;
    va_start(args, fmt);
    vsnprintf(buffer, sizeof(buffer), fmt, args);
    va_end(args);
    HAL_UART_Transmit(&huart2, (uint8_t *)buffer, strlen(buffer), HAL_MAX_DELAY);
}



/*Bootloader handler function implementations*/
void BL_getver_handler(uint8_t *rx_buffer)
{
	//uart_printf("we are in getver command execution\r\n");
	uint32_t cmd_packet_len = rx_buffer[0] + 1;
	uint8_t BL_version;
	// extract CRC sent by host
	uint32_t host_crc = *((uint32_t *)(rx_buffer + cmd_packet_len - 4));

	if (!BL_CRC_check(&rx_buffer[0], cmd_packet_len-4, host_crc)){
		//uart_printf("Check sum success\r\n");
		BL_version = (uint8_t)BL_VERSION;
		BL_send_ack(rx_buffer[0], 1);
		uart_printf("Bootloader version: %d %#x\r\n",BL_version,BL_version );
		HAL_UART_Transmit(Command_UART,(uint8_t*)BL_version,1,HAL_MAX_DELAY);


	}else{
		uart_printf("Check sum failed\r\n");
		BL_send_nack();
	}
}

void BL_getrdp_handler(uint8_t *rx_buffer)
{
	uint8_t rdp_val = 0x00;
	volatile uint32_t *pOptionByte = (uint32_t*)0x1FFFC000;
	rdp_val = (uint8_t)(*pOptionByte >> 8); //reads bits 8 to 15 for protection level: 0xAA (L0), 0xCC(L2), and other(L1) for different protection levels
	uint32_t cmd_packet_len = rx_buffer[0] + 1;
	uint32_t host_crc = *((uint32_t *)(rx_buffer + cmd_packet_len - 4));

	if (!BL_CRC_check(&rx_buffer[0], cmd_packet_len-4, host_crc)){
		BL_send_ack(rx_buffer[0], 1);
		uart_printf("BL_DEBUG_MSG:RDP level: %d %#x\n",rdp_val,rdp_val );
		HAL_UART_Transmit(Command_UART,rdp_val,sizeof(rdp_val),HAL_MAX_DELAY);


	}else{
		uart_printf("BL_DEBUG_MSG:checksum fail !!\n");
		BL_send_nack();
	}

}
void BL_jump_handler(uint8_t *rx_buffer)
{

}
void BL_flash_erase_handler(uint8_t *rx_buffer)
{

}
void BL_mem_write_handler(uint8_t *rx_buffer)
{

}
void BL_control_rw_protect_handler(uint8_t *rx_buffer)
{

}
void BL_mem_read_handler(uint8_t *rx_buffer)
{

}
void BL_read_sector_status_handler(uint8_t *rx_buffer)
{

}
void BL_read_otp_handler(uint8_t *rx_buffer)
{

}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE3);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 16;
  RCC_OscInitStruct.PLL.PLLN = 336;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV4;
  RCC_OscInitStruct.PLL.PLLQ = 2;
  RCC_OscInitStruct.PLL.PLLR = 2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief CRC Initialization Function
  * @param None
  * @retval None
  */
static void MX_CRC_Init(void)
{

  /* USER CODE BEGIN CRC_Init 0 */

  /* USER CODE END CRC_Init 0 */

  /* USER CODE BEGIN CRC_Init 1 */

  /* USER CODE END CRC_Init 1 */
  hcrc.Instance = CRC;
  if (HAL_CRC_Init(&hcrc) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN CRC_Init 2 */

  /* USER CODE END CRC_Init 2 */

}

/**
  * @brief USART2 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART2_UART_Init(void)
{

  /* USER CODE BEGIN USART2_Init 0 */

  /* USER CODE END USART2_Init 0 */

  /* USER CODE BEGIN USART2_Init 1 */

  /* USER CODE END USART2_Init 1 */
  huart2.Instance = USART2;
  huart2.Init.BaudRate = 115200;
  huart2.Init.WordLength = UART_WORDLENGTH_8B;
  huart2.Init.StopBits = UART_STOPBITS_1;
  huart2.Init.Parity = UART_PARITY_NONE;
  huart2.Init.Mode = UART_MODE_TX_RX;
  huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart2) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN USART2_Init 2 */

  /* USER CODE END USART2_Init 2 */

}

/**
  * @brief USART3 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART3_UART_Init(void)
{

  /* USER CODE BEGIN USART3_Init 0 */

  /* USER CODE END USART3_Init 0 */

  /* USER CODE BEGIN USART3_Init 1 */

  /* USER CODE END USART3_Init 1 */
  huart3.Instance = USART3;
  huart3.Init.BaudRate = 115200;
  huart3.Init.WordLength = UART_WORDLENGTH_8B;
  huart3.Init.StopBits = UART_STOPBITS_1;
  huart3.Init.Parity = UART_PARITY_NONE;
  huart3.Init.Mode = UART_MODE_TX_RX;
  huart3.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart3.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart3) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN USART3_Init 2 */

  /* USER CODE END USART3_Init 2 */

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  /* USER CODE BEGIN MX_GPIO_Init_1 */

  /* USER CODE END MX_GPIO_Init_1 */

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOC_CLK_ENABLE();
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOB_CLK_ENABLE();

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_RESET);

  /*Configure GPIO pin : B1_Pin */
  GPIO_InitStruct.Pin = B1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(B1_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : LD2_Pin */
  GPIO_InitStruct.Pin = LD2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(LD2_GPIO_Port, &GPIO_InitStruct);

  /* USER CODE BEGIN MX_GPIO_Init_2 */

  /* USER CODE END MX_GPIO_Init_2 */
}
void BL_send_ack(uint8_t command_code, uint8_t len){
	//send 2 bytes. first byte is ack and second len value
	uint8_t buffer[2];
	buffer[0] = BL_ACK;
	buffer[1] = len;
	HAL_UART_Transmit(Command_UART, buffer, 2, HAL_MAX_DELAY);
}

void BL_send_nack(void){
	uint8_t nack=BL_NACK;
	HAL_UART_Transmit(Command_UART, &nack, 1, HAL_MAX_DELAY);
}

uint8_t BL_CRC_check(uint8_t *pData, uint32_t len, uint32_t crc_host)
{
	uint32_t uwCRCValue = 0xff;
	for (uint32_t i = 0; i<len; i++){
		uint32_t i_data = pData[i];
		uwCRCValue = HAL_CRC_Accumulate(&hcrc, &i_data, 1);
	}
	//reset CRC
	__HAL_CRC_DR_RESET(&hcrc);
	if(uwCRCValue == crc_host){
		return VERIFY_CRC_SUCCESS;
	}
	return VERIFY_CRC_FAIL;
}
/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
